app/controllers/users_controller.rb

  def create
    user = User.create(params[:user])
---
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "email1"], ["first_name", "first_name1"], ["last_name", "last_name1"], ["password_digest", "$2a$10$oI03ig.OkHTWIQXQpeTKQOAQFu/zLjCoP2Ar9spZ9YujFpg65kY8."], ["username", "username1"]]